# Cleaning the datasets

We must remove rows with null values in certain columns, since they will not help us in answering our questions and they do not fit our schema. Furthermore, we must shuffle some of the datasets. This is because the UofT CS server cannot handle very large files, so we will have to limit the number of tuples to around 40000. Without the shuffling, our reduced dataset would be skewed (since it is currently sorted by alphabetical order in some cases).

In [1]:
import numpy as np
import pandas as pd

#Let's start by cleaning the officer dataset

officerDF = pd.read_csv("./raw-data/paradise_papers.nodes.officer.csv")

officerDF.head()

        oID             oName  cID
0  59160036  RADOMIR VUKCEVIC  NaN
1  59178341     ANA DUKANOVIC  NaN
2  59190179     ANA KOLAREVIC  NaN
3  59152278         Ranin Ltd  NaN
4  59127837   DAVID MARINELLI  NaN

In [6]:
#Remove tuples/rows that do not contain country IDs
officerDF = officerDF.dropna(axis=0, subset=['cID'])

officerDF = officerDF[officerDF['cID'].map(len) < 4]

officerDF.head()

             oID                   oName  cID
5076    80042957              Burt - Kay  GBR
284031  56043300           SILVIA ATTARD  MLT
326819  56092311  JACEK KRZYSZTOF BLADEK  POL
256002  56019521     CATLIN CAPITAL LTD.  VGB
239598  56001470          CORINNE VIOGET  CHE

In [62]:
#Reduce size (CS teaching labs can handle 1000 rows well but not much more)
officerDF = officerDF.sample(frac=0.3)

officerDF = officerDF[officerDF['oName'].map(len) < 100]

#Export clean dataset 
officerDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\Officer.csv',index = False)

In [63]:
entityDF = pd.read_csv("./raw-data/paradise_papers.nodes.entity.csv")

entityDF.head()

,eID,eName,jurisdictionID,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,85004927,OCEAN,AW,NaN,NaN,NaN,NaN,NaN,NaN
1,85004928,EFFICIENCY IN OPERATION,AW,NaN,NaN,NaN,NaN,NaN,NaN
2,85004930,ARUBA WATER SYSTEMS N.V.,AW,NaN,NaN,NaN,NaN,NaN,NaN
3,85008431,ESSA N.V.,AW,NaN,NaN,NaN,NaN,NaN,NaN
4,85008432,FIRST HOME INSURANCE SERVICES (ARUBA) N.V.,AW,NaN,NaN,NaN,NaN,NaN,NaN

In [64]:
entityDF = entityDF[['eID','eName','jurisdictionID']]

entityDF = entityDF[entityDF['jurisdictionID'].map(len) < 4]

entityDF = entityDF.dropna(axis=0, subset=['jurisdictionID'])

entityDF = entityDF.dropna(axis=0, subset=['eName'])

entityDF = entityDF[entityDF['eName'].map(len) < 100]

entityDF.head()

        eID                                       eName jurisdictionID
0  85004927                                       OCEAN             AW
1  85004928                     EFFICIENCY IN OPERATION             AW
2  85004930                    ARUBA WATER SYSTEMS N.V.             AW
3  85008431                                   ESSA N.V.             AW
4  85008432  FIRST HOME INSURANCE SERVICES (ARUBA) N.V.             AW

In [67]:
#Need to shuffle entity dataset since it is sorted with jurisdiction in alphabetical order

entityDF = entityDF.sample(frac=0.2)

entityDF = entityDF[entityDF.jurisdictionID != 'XX']

entityDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\Entity.csv',index = False)

entityDF.head()

              eID                                 eName jurisdictionID
15520    82023444               NAB Investments Limited             KY
223832   55020553                   TGF ESTATES LIMITED            MLT
260614   55058014  A & M CONSULTANCY & SERVICES LIMITED            MLT
83361    30013879                          SULLIVAN LTD            BAH
151050  200118473            FALCON FINANCE CORPORATION            KNA

In [55]:
#Clean intermediary dataset

interDF = pd.read_csv("./raw-data/paradise_papers.nodes.intermediary.csv")

interDF = interDF.dropna(axis=0, subset=['cID'])

interDF = interDF[interDF['cID'].map(len) < 4]

#Export clean dataset 
interDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\Intermediary.csv',index = False)

In [56]:
interDF.head()

        iID                                     iName  cID
0  34304771               CITITRUST (BAHAMAS) LIMITED  BHS
1  80000189         Appleby Management (Bermuda) Ltd.  BMU
2  80000191           Appleby Services (Bermuda) Ltd.  BMU
3  80000392  Appleby Corporate Services (BVI) Limited  VGB
4  80007709   Appleby Corporate Services (HK) Limited  HKG

In [57]:
#Clean human development index dataset

hdiDF = pd.read_csv("./raw-data/Human development index (HDI).csv")

hdiDF = hdiDF[['hdiRank','cName']]

#Export clean dataset 
hdiDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\HumanDevelopment.csv',index = False)

In [58]:
hdiDF.head()

   hdiRank        cName
0      170  Afghanistan
1       69      Albania
2       82      Algeria
3       36      Andorra
4      149       Angola

In [59]:
corruptDF = pd.read_csv("./raw-data/corruption_perception.csv")

corruptDF = corruptDF[['cID','cpindex']]

#Export clean dataset 
corruptDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\CorruptionPerception.csv',index = False)

In [60]:
corruptDF.head()

   cID  cpindex
0  DNK       88
1  NZL       87
2  FIN       85
3  SGP       85
4  SWE       85

In [35]:
#For country dataset, must merge dataset that contains population and the one that contains the ISO alpha-3 codes
popDF = pd.read_csv("./raw-data/population.csv")

countryDF = pd.read_csv("./raw-data/country.csv")

completeCountryDF = pd.merge(countryDF, popDF, how='inner', on='cName')

completeCountryDF = completeCountryDF[['cName','cID','population']]

completeCountryDF.to_csv(r'C:\Users\00mon\VSCode\paradise-papers\clean-data\Country.csv',index = False)

In [36]:
completeCountryDF.head()

    cName  cID  population
0   Aruba   AW     106.766
1  Jersey  JEY      98.070
2  Monaco  MCO      39.242
3    Niue  NIU       1.626
4   Nauru  NRU      10.824